package lecture5.exercises;

/*
    ამ ამოცანის მიზანია შევქმნათ ქართული რიგი, სადაც იქნება სამი ტიპის რიგი,
    ყველაზე მაღალი პრიორიტეტი მიენიჭება ნათესავების რიგს,
    შემდეგ ჩაწერილი მომხმარებლების რიგს
    ხოლო ბოლო პრიორიტეტი ექნება ცოცხალ რიგს,
    სანამ იარსებებს ნათესავი რიგში მანამ ის იქნება პრიორიტეტული, შემდეგი პრიორიტეტი მიენიჭებათ ჩაწერილ მომხმარებლებს,
    ბოლოს კი მდგომიარე რიგის მომხმარებლებს. ამ პირობის მიხედვით დააიმპლემენტირეთ ქიუს შემდეგი მეთოდები.
 */
public class GeorgianQueue<T> {


    public void add(T data, QueueType queueType) {

    }

    public T remove() {
        return null;
    }

    public T peek() {
        return null;
    }

    public int size() {
        return 0;
    }
}
